# IsDone Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExportFontTableIterator..::..IsDone Method
ExportFontTableIterator Class See Also
---
Identifies if the iteration has completed.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public virtual bool IsDone()
```

Visual Basic
---
```text
Public Overridable Function IsDone As Boolean
```

Visual C++
---
```text
public:
virtual bool IsDone()
```

# ### Return Value
True if the iteration has no more items. False if there are more items to be iterated.
# See Also
ExportFontTableIterator Class
Autodesk.Revit.DB Namespace